import { HistoryDataType } from 'shared/types';

export const HISTORY_DATA: HistoryDataType[] = [
  {
    startYear: 1990,
    endYear: 1996,
    sphere: 'IT',
    events: [
      {
        year: 1990,
        description: 'Начало распространения интернета по всему миру, изменившее коммуникацию и бизнес.',
      },
      {
        year: 1991,
        description: 'Запуск Windows 95, революция в пользовательских системах.',
      },
      {
        year: 1993,
        description: 'Создание первого веб-браузера Mosaic, открывшего доступ к интернету.',
      },
      {
        year: 1995,
        description: 'Открытие сайта Amazon, ставшего крупнейшим онлайн-ретейлером.',
      },
      {
        year: 1996,
        description: 'Появление первых мобильных телефонов с цветным экраном.',
      },
    ],
  },
  {
    startYear: 1998,
    endYear: 2001,
    sphere: 'Кино',
    events: [
      {
        year: 1998,
        description: 'Выход "Титаника", одного из самых успешных фильмов всех времен.',
      },
      {
        year: 1999,
        description: 'Премьера "Матрицы", повлиявшей на спецэффекты и кинематограф.',
      },
      {
        year: 2000,
        description: 'Выход фильма "Гладиатор", получившего несколько Оскаров.',
      },
      {
        year: 2001,
        description: 'Премьера "Властелина колец", начавшего успешную киносагу.',
      },
    ],
  },
  {
    startYear: 2003,
    endYear: 2007,
    sphere: 'Медицина',
    events: [
      {
        year: 2003,
        description: 'Расшифровка генома человека, открывшая новые горизонты в медицине.',
      },
      {
        year: 2004,
        description: 'Начало массовой вакцинации против гриппа, что снизило смертность.',
      },
      {
        year: 2005,
        description: 'Успешное лечение с использованием стволовых клеток для восстановления тканей.',
      },
      {
        year: 2007,
        description: 'Создание препаратов для лечения ВИЧ, улучшивших качество жизни.',
      },
    ],
  },
  {
    startYear: 2008,
    endYear: 2012,
    sphere: 'Музыка',
    events: [
      {
        year: 2008,
        description: 'Выход альбома "The Fame" Леди Гаги, ставшего мировым хитом.',
      },
      {
        year: 2009,
        description: 'Возрождение интереса к поп-музыке и танцевальным трекам.',
      },
      {
        year: 2010,
        description: 'Выпуск альбома "Recovery" Эминема, ставшего гимном восстановления.',
      },
      {
        year: 2011,
        description: 'Появление жанра "Dubstep", революционизировавшего электронную музыку.',
      },
      {
        year: 2012,
        description: 'Альбом "21" Адель, ставший культовым в музыкальной индустрии.',
      },
    ],
  },
  {
    startYear: 2014,
    endYear: 2019,
    sphere: 'Наука',
    events: [
      {
        year: 2014,
        description: 'Запуск усилий по защите окружающей среды и борьбе с изменением климата.',
      },
      {
        year: 2016,
        description: 'Внедрение искусственного интеллекта в медицину для улучшения диагностики.',
      },
      {
        year: 2017,
        description: 'Разработка новых методов лечения рака, спасших тысячи жизней.',
      },
      {
        year: 2019,
        description: 'Прорыв в генной терапии, открывший новые возможности для лечения.',
      },
    ],
  },
  {
    startYear: 2020,
    endYear: 2024,
    sphere: 'Космос',
    events: [
      {
        year: 2020,
        description: 'Запуск миссий по исследованию Марса, включая Perseverance.',
      },
      {
        year: 2021,
        description: 'Создание коммерческих космических путешествий, как SpaceX и Blue Origin.',
      },
      {
        year: 2022,
        description: 'Создание планов по строительству базы на Луне.',
      },
      {
        year: 2023,
        description: 'Исследование других планет и запуск новых миссий по изучению Солнечной системы.',
      },
      {
        year: 2024,
        description: 'Прорыв в космическом туризме, включая первый коммерческий полет в космос.',
      },
    ],
  },
];
